<?php
include 'header.php';
?>
<div class = "main">
  <h4>更新日志</h4>
  <span class="txt_clean">
<p>2016-05-21 v1.5.0</p>
重写核心监控脚本<br/>
调整'实用工具'页面，新增设备状态验证功能<br/>
其他优化调整<br/>
<p>2016-04-26 v1.4.3</p>
优化监控脚本数据库更新操作<br/>
优化短信平台的FTP传输脚本<br/>
修正expect('ssword')等一些bug<br/>
<p>2016-04-22 v1.4.2</p>
短信调整为按照用户(区分城市)设置手机号码发送短信<br/>
修正添加设备时采用某些特殊字符作为密码不成功的bug<br/>
<p>2016-04-16 v1.4.1</p>
对接短信平台1<br/>
修正ftp中文编码bug <br/>
调整线路告警为[关闭|普通|优先],普通级别短信发送时间早7点-晚9点，优先级别短信24小时发送 <br/>
优化配置保存代码 <br/>
<p>2016-04-09 v1.4.0</p>
优化核心监控脚本，重写告警模块 <br/>
新增serverIP/netmon/log/link.log日志文件：记录线路通断日志 <br/>
邮件报警正文提供线路详情 <br/>
对于'监控关闭'的线路修正显示为'disabled' <br/>
<p>2016-04-02 v1.3.8</p>
增加线路详情页面操作，新增数据库detail表 <br/>
<p>2016-03-28 v1.3.7</p>
演练环境,设置smtp服务器bug修正 <br/>
更新netmon.docx <br/>
<p>2016-03-27 v1.3.6</p>
演示环境准备完成，导出OVA <br/>
<p>2016-03-27 v1.3.3</p>
修正管理员添加用户密码未加密 <br/>
修正[配置管理]删除功能 <br/>
<p>2016-03-26 v1.3.2</p>
升级版本功能修正 <br/>
<p>2016-03-29 v1.3.1</p>
增加管理员页面[升级版本]功能 <br/>
<p>2016-03-12 v1.3.0</p>
[外联平台]显示页面数据筛选方法优化，部分bug修复 <br/>
<p>2016-03-05 v1.2.4</p>
增加管理员页面，所有管理操作在网页上配置，无需登陆linux系统 <br/>
<p>2016-02-14 v1.2.3</p>
监控脚本异常处理bug修复 <br/>
<p>2016-02-07 v1.2.2</p>
重写日志模块 <br/>
<p>2016-01-17 v1.2.0</p>
代码托管GIT，数据库表重新调整 <br/>
<p>2015-12-06 v1.1.0</p>
增加[用户设置]页面，管理用户密码，报警开关，报警邮箱 <br/>
<p>2015-11-01 v1.0.3</p>
增加城市选择，对应区分管理用户和设备 <br/>
<p>2015-10-11 v1.0.0</p>
基础监控脚本，基础邮件告警，基础网页显示 <br/>
  </span>
</div>
<?php
include 'footer.php';
?>
